app/controllers/shows_controller.rb

SELECT `channels`.* FROM `channels` WHERE `channels`.`id` IN (4, 1, 3, 2, 5)
SELECT `shows`.* FROM `shows`
---
    def index
        @shows = Show.includes(:channel)

SELECT `shows`.* FROM `shows` INNER JOIN `channels` ON `channels`.`id` = `shows`.`channel_id` WHERE (lower(channels.name) LIKE '%discove%' OR lower(shows.name) LIKE '%discove%') ORDER BY shows.name DESC
---
    def search
        if params[:search].blank?
            redirect_to root_path
        else
            search_params = params[:search].downcase
            @shows = Show.joins(:channel).search(search_params)

SELECT `shows`.* FROM `shows` WHERE `shows`.`id` = 2 LIMIT 1
UPDATE `shows` SET `shows`.`is_fav` = FALSE, `shows`.`updated_at` = '2020-02-01 09:45:07.791347' WHERE `shows`.`id` = 2
---
    def update
        show = Show.find(params[:id])
        if show.update_attributes(is_fav: params[:is_fav])